import random
import re

##クラス##
class FResponder:
    ##関数##
    #-----------------------------------------------------
    # クラス呼び出し時
    #-----------------------------------------------------
    def __init__(self, name):
        self.name = name
    
    #-----------------------------------------------------
    # 定義のみ
    #-----------------------------------------------------
    # input: 送信した文字列
    #-----------------------------------------------------
    # 戻値 ：なし
    #-----------------------------------------------------
    def response(self, input):
        return ''

##クラス##
class RepeatResponder(FResponder):
    ##関数##
    #-----------------------------------------------------
    # クラス呼び出し時
    #-----------------------------------------------------
    # name: 生成したオブジェクトのnameフィールド
    #-----------------------------------------------------
    # 戻値 ：なし
    #-----------------------------------------------------
    def __init__(self, name):
        super().__init__(name)

    #-----------------------------------------------------
    # 返答関数
    #-----------------------------------------------------
    # input: 送信した文字列
    #-----------------------------------------------------
    # 戻値 ：文字列
    #-----------------------------------------------------
    def response(self, input):
        return '{} とは？'.format(input)

##クラス##
class RandomResponder(FResponder):
    ##関数##
    #-----------------------------------------------------
    # クラス呼び出し時
    #-----------------------------------------------------
    # name: 生成したオブジェクトのnameフィールド
    #-----------------------------------------------------
    # 戻値 ：なし
    #-----------------------------------------------------
    def __init__(self, name, dic_random):
        super().__init__(name)
        self.responses = dic_random

    #-----------------------------------------------------
    # 返答関数
    #-----------------------------------------------------
    # input: 送信した文字列
    #-----------------------------------------------------
    # 戻値 ：文字列
    #-----------------------------------------------------
    def response(self, input, mood):
        return (random.choice(self.responses))

##クラス##
class PatternResponder(FResponder):
    def __init__(self, name, dictionary):
        super().__init__(name)
        self.dictionary = dictionary

    def response(self, input, mood):
        resp = None
        for ptn_item in self.dictionary.pattern:        
            m = ptn_item.match(input)
            if m:
                resp  = ptn_item.choice(mood)
            if resp != None:
                return re.sub('%match%', m.group(), resp)
        return random.choice(self.dictionary.random)